{
    "navbar": {
        "Item1": "Обо мне",
        "Item2": "Проекты",
        "Item3": "Контакт"
    },
    "introduction": {
        "welcome": "Привет меня зовут",
        "name": "Мухаммед.",
        "title": "Я создаю сайты для Интернета.",
        "subtitle": "Я Frontend-разработчик, специализирующийся на создании и разработке исключительных веб-сайтов/веб-приложений."
    },
    "about_me": {
        "location": "Обо мне",
        "part1": "Работаю фронтенд-разработчиком 2 года, специализируюсь на ReactJS и Typescript. Мой основной стек — это MERN с ReactJS или NextJS, и мне нравится работать с командой. Я полностью сосредоточился на развитии своих навыков каждый день, и в эти дни я сосредоточился на создании красивых и чистых веб-сайтов с помощью ReactJS. и Typescript.",
        "part2": "Я с нетерпением жду возможности работать с любой компанией и продвигать компанию вперед с помощью новых технологий и новых языков."
    },
    "projects": {
        "location": "Мои проекты",
        "project1": {
            "description": "В этом проекте я сделал приложение для покупки одежды MERN React, добавил платежную систему, систему корзины покупок, Яндекс Метрику и фильтрацию, а также сделал RestAPI для выполнения CRUD-операций и MongoDB для хранения всех данных о товарах и заказах. Для этого проекта я использовал ReactJS, Redux, Styled-Components, Yandex Metrika и бэкэнд REST API, созданный с помощью Node, ExpressJS и MongoDB."
        },
        "project2": {
            "description": "В этом проекте я создал панель администратора для своего проекта электронной коммерции, чтобы управлять всеми продуктами, пользователями и сведениями о доходах. Для этого проекта я использовал React, Typescript, MUI, React-Router, Styled-Components и Recharts для графиков."
        },
        "project3": {
            "description": "В этом проекте я сделал сайт React, который рассказывает о космосе и некоторых планетах Солнечной системы. Я сделал этот проект, потому что интересовался космосом и был рад показать людям космический мир на сайте. для этого проекта я использовал ReactJS, Typescript, React-router, StyledComponents и Figma для дизайн."
        },
        "project4": {
            "description": "Я сделал этот сайт, потому что использовал множество сайтов для отслеживания посылок, и некоторые из них не работали должным образом, поэтому я сделал свой собственный, который использует современные технологии дляобновления информации.Для этого проекта я использовал NextJS, Typescript, Styled-Components, MaterialUI, SSR и небольшой бэкенд API,чтобы я мог скрыть свой ключ API."
        },
        "project5": {
            "description": "В этом проекте я создал библиотеку книг, которая может искать книги в API книг Google и фильтровать их с помощью сортировки и категорий, а также имеет кнопку «Загрузить больше», чтобы загружать больше книг. Я сделал это с помощью ReactJS, Styled-components и Typescript."
        },
        "project6": {
            "description": "В этом проекте я создал новостное приложение с последними новостями и различными категориями новостей. Я сделал это с помощью ReactJS, Styled-Components, Typescript, Redux Toolkit и NewsAPI."
        },
        "project7": {
            "description": "В этом проекте я создал приложение для управления вашими задачами, сохранения статуса их выполнения и добавления/удаления задач. Я использовал его с помощью ReactJS, Typescript, Redux-Toolkit и Styled-Components."
        },
        "see_project_button": "Посмотреть проект",
        "see_projectCode_button": "Посмотреть код"
    },
    "contact_me": {
        "location": "Контакт",
        "title": "Связаться",
        "description1": "В настоящее время я ищу любые новые возможности, мой почтовый ящик всегда открыт.",
        "description2": "Если у вас есть вопрос или вы просто хотите сказать привет, я сделаю все возможное, чтобы ответить вам!",
        "button": "Свяжитесь со мной"
    }
}